app/controllers/dailynotes_controller.rb

INSERT INTO `dailynotes` (`updated_at`, `user_id`, `created_at`, `note`, `weeklynote_id`, `date`) VALUES('2013-01-23 14:49:52', 1, '2013-01-23 14:49:52', 'testd098', 4, '2013-01-08 00:00:00')
---
  def create
    if @weeklynote_to_belong.nil?
      flash.now[:alert] = "你还没有新建周计划，请到新建工作周报中新建！"
      respond_to do |format|
        format.js do
          render :update do |page|
            page.replace_html 'notice_and_alert', :partial => 'common/notice_and_alert'
          end
        end
      end
    else
      dailynote = Dailynote.new(:date => params[:date],
        :note => params[:dailynote],
        :user_id => current_user.id,
        :weeklynote_id => @weeklynote_to_belong.id)
      if dailynote.save

SELECT * FROM `dailynotes` WHERE (`dailynotes`.`date` IN ('2012-12-21 00:00:00','2012-12-20 00:00:00','2012-12-19 00:00:00','2012-12-18 00:00:00','2012-12-17 00:00:00') AND `dailynotes`.`user_id` = 1) ORDER BY date
UPDATE `dailynotes` SET `note` = 'test\nhg\n了', `updated_at` = '2012-12-09 15:29:01' WHERE `id` = 1
---
  def update
    dailynote = Dailynote.find(:first, :conditions => {:date => params[:date], :user_id => current_user.id})
    dailynote.note = params[:dailynote]
    if dailynote.save

SELECT * FROM `dailynotes` WHERE (`dailynotes`.`user_id` = 1 AND `dailynotes`.`date` = '2012-12-09') LIMIT 1
---
  def date_change
    dailynote = Dailynote.find(:first, :conditions => {:date => params[:date], :user_id => current_user.id})

SELECT * FROM `dailynotes` WHERE (`dailynotes`.`user_id` = 1 AND `dailynotes`.`date` IN ('2013-01-10 00:00:00','2013-01-09 00:00:00','2013-01-08 00:00:00','2013-01-07 00:00:00','2013-01-11 00:00:00')) ORDER BY date
INSERT INTO `dailynotes` (`created_at`, `date`, `note`, `updated_at`, `user_id`) VALUES('2012-12-26 14:22:01', '2012-12-26 00:00:00', 'test1226', '2012-12-26 14:22:01', 1)
---
  def preview
    dailynote = Dailynote.find(:first, :conditions => {:date => params[:date], :user_id => current_user.id})
    if dailynote.nil?
      dailynote = Dailynote.create(:date => params[:date], :note => params[:dailynote], :user_id => current_user.id)

SELECT * FROM `dailynotes` WHERE (`dailynotes`.`date` IN ('2012-12-16 00:00:00','2012-12-15 00:00:00','2012-12-14 00:00:00','2012-12-13 00:00:00','2012-12-12 00:00:00','2012-12-11 00:00:00','2012-12-10 00:00:00') AND `dailynotes`.`user_id` = 1) ORDER BY date
---
  def find_dailynotes
    @dailynotes = Dailynote.find(:all, :conditions => {:user_id => current_user.id}, :order => "date DESC", :limit => 7)

SELECT * FROM `weeklynotes` WHERE (`weeklynotes`.`user_id` = 1 AND `weeklynotes`.`start_date` = '2013-01-07') LIMIT 1
---
  def find_weeklynotes
    @weeklynotes = Weeklynote.find(:all, :conditions => {:user_id => current_user.id}, :order => "start_date DESC", :limit => 2)