app/controllers/receivers_controller.rb

  def create
    receiver = Receiver.new(:name => params[:name], :email => params[:email_address], :user_id => current_user.id)
    if params[:contact_type] == 'to'
      receiver.contact_type = TO
    else
      receiver.contact_type = CC
    end
    if receiver.save
---
INSERT INTO `receivers` (`email`, `user_id`, `updated_at`, `created_at`, `name`, `contact_type`) VALUES('beyondyuqifeng@sina.com', 1, '2013-01-29 13:23:09', '2013-01-29 13:23:09', '俞其峰', 2)

  def delete
    contact_to_delete = Receiver.find(params[:id])
    @contact_type = contact_to_delete.contact_type
    contact_to_delete.destroy
---
SELECT * FROM `receivers` WHERE (`receivers`.`id` = 2)
DELETE FROM `receivers` WHERE `id` = 2

  def edit
    @contact = Receiver.find(params[:id])
---
SELECT * FROM `receivers` WHERE (`receivers`.`id` = 1)

  def edit_save
    @contact = Receiver.find(params[:id])
    @contact.name = params[:name]
    @contact.email = params[:email_address]
    if @contact.save
---
SELECT * FROM `receivers` WHERE (`receivers`.`id` = 1)
UPDATE `receivers` SET `name` = '俞其峰', `updated_at` = '2013-01-29 13:22:47' WHERE `id` = 1

  def switch
    contact = Receiver.find(params[:id])
    contact.contact_type == TO ? contact.contact_type = CC : contact.contact_type = TO
    if contact.save
---
SELECT * FROM `receivers` WHERE (`receivers`.`id` = 1)
UPDATE `receivers` SET `updated_at` = '2012-12-03 15:30:10', `contact_type` = 2 WHERE `id` = 1

  def find_contacts
    @recipients = Receiver.find(:all, :conditions => {:user_id => current_user.id, :contact_type => TO})
---
SELECT * FROM `receivers` WHERE (`receivers`.`user_id` = 1 AND `receivers`.`contact_type` = 1)