app/controllers/users_controller.rb

  def update
    current_user.lastname = params[:lastname] unless params[:lastname].nil?
    current_user.firstname = params[:firstname] unless params[:firstname].nil?
    if current_user.save
---
UPDATE `users` SET `lastname` = '俞', `firstname` = '其峰', `updated_at` = '2013-01-24 14:03:45' WHERE `id` = 1