app/controllers/weeklynotes_controller.rb

INSERT INTO `weeklynotes` (`start_date`, `user_id`, `note`, `created_at`, `updated_at`, `end_date`) VALUES('2012-12-31 00:00:00', 1, '--- \n- :weeklynote\n', '2013-01-03 07:14:41', '2013-01-03 07:14:41', '2013-01-06 00:00:00')
---
  def create
    weeklynote = Weeklynote.new(:start_date => params[:start_date],
      :end_date => Date.parse(params[:start_date]) + 7,
      :note => params[:weeklynote],
      :user_id => current_user.id)
    if weeklynote.save

UPDATE `weeklynotes` SET `updated_at` = '2013-01-07 14:51:55', `note` = 'test\nvg' WHERE `id` = 1
---
  def update
    @weeklynote.note = params[:weeklynote]
    if @weeklynote.save

SELECT * FROM `weeklynotes` WHERE (`weeklynotes`.`user_id` = 1 AND `weeklynotes`.`start_date` = '2012-12-31') LIMIT 1
---
  def find_weeklynotes
    @weeklynotes = Weeklynote.find(:all, :conditions => {:user_id => current_user.id}, :order => "start_date DESC", :limit => 2)